// // Напиши скрипт, який об'єднує всі елементи массива в один рядок.  Елементів може бути довільна кількість. Нехай елементи массива  в рядку будут розділені комою.
// //  👉 Спочатку через for
// //  👉 Потім через join()

// // const numbers = ['one', 'two', 'three', 'four', 'five']

// // // join

// // console.log(numbers.join(' '));

// // // for
// // let array = ["one", "two", "three", "four", "five"];
// // let sum = 0;

// // for (let i = 0; i < array.length; i++) {
// //   sum += array[i] + " ";
// // }

// // console.log(sum);

// // 2. Працюємо з колекцією карток в trello. Метод splice() (можна використати інші методи)

// const cards = [
//     'карточка-1',
//     'карточка-2',
//     'карточка-3',
//     'карточка-4',
//     'карточка-5',
//   ];
  
//   console.log(cards)
  
//   // ВИДАЛИТИ !!!!!!!!
  
//   // const cardToRemove = cards.indexOf('карточка-3');
  
//   // if (cardToRemove !== -1) {
//   //   cards.splice(cardToRemove, 1);
//   // }
  
//   // console.log(cards);
  
//   // ДОДАТИ !!!!!!!!
  
//   // const cardToAdd = 1; 
//   // const newCard = 'нова-карточка'; 
  
//   // cards.splice(cardToAdd, 0, newCard);
  
//   // console.log(cards);
  
//   // ОНОВИТИ !!!!!!!!
  
//   // const cardoUpdate = 4;
//   // const updatedCard = 'оновлена-карточка';
  
//   // cards[cardoUpdate] = updatedCard;
  
//   // console.log(cards);